### Terraform plan output for `./terraform/env/dev`
#### Contains changes: `yes`

<details><summary>Show Plan</summary>

```
module.flex_gateway.data.secretsmanager_login.prometheus_basic: Reading...
module.flex_gateway.data.secretsmanager_login.loki_basic: Reading...
module.flex_gateway.data.secretsmanager_file.registration: Reading...
module.flex_gateway.data.secretsmanager_login.redis: Reading...
module.flex_gateway.data.secretsmanager_login.loki_basic: Read complete after 0s [id=TVNsnRso_U7J_raing91Dw]
module.flex_gateway.data.secretsmanager_login.prometheus_basic: Read complete after 0s [id=9edLxyQsbIoU5lw7K3m36w]
module.flex_gateway.data.secretsmanager_login.redis: Read complete after 0s [id=8F2CC6bDetXZlOm0Trrs8A]
module.flex_gateway.aws_security_group.redis: Refreshing state... [id=sg-0b7cfc185ea913305]
module.flex_gateway.aws_elasticache_subnet_group.main: Refreshing state... [id=flex-gateway-dev]
module.flex_gateway.aws_iam_policy.ssm: Refreshing state... [id=arn:aws:iam::975050025792:policy/flex-gateway-dev-ssm]
module.flex_gateway.aws_security_group.ec2: Refreshing state... [id=sg-0bca177863bb2791c]
module.flex_gateway.aws_security_group.alb: Refreshing state... [id=sg-0dec07c26db1c77ab]
module.flex_gateway.aws_ssm_parameter.flex_gateway_version: Refreshing state... [id=/flex-gateway/dev/flex_gateway_version]
module.flex_gateway.data.aws_ssm_parameter.kms_id: Reading...
module.flex_gateway.aws_lb_target_group.flex_gateway: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:975050025792:targetgroup/flex-gateway-dev-flex-gateway/047c2c47341b3ee2]
module.flex_gateway.aws_iam_role.ec2: Refreshing state... [id=flex-gateway-dev-ec2]
module.flex_gateway.data.secretsmanager_file.registration: Read complete after 1s [id=Atnut-qOEErxdf83itZxFg]
module.flex_gateway.aws_s3_bucket.main: Refreshing state... [id=phl-citygeo-flex-gateway-dev]
module.flex_gateway.data.aws_ssm_parameter.kms_id: Read complete after 0s [id=/mulesoft/common/kms_id]
module.flex_gateway.data.aws_ssm_parameter.kms_arn: Reading...
module.flex_gateway.aws_ssm_parameter.loki_pw: Refreshing state... [id=/flex-gateway/dev/loki_pw]
module.flex_gateway.aws_ssm_parameter.prometheus_pw: Refreshing state... [id=/flex-gateway/dev/prometheus_pw]
module.flex_gateway.aws_ssm_parameter.prometheus_user: Refreshing state... [id=/flex-gateway/dev/prometheus_user]
module.flex_gateway.data.aws_ssm_parameter.kms_arn: Read complete after 0s [id=/mulesoft/common/kms_arn]
module.flex_gateway.aws_ssm_parameter.redis_pw: Refreshing state... [id=/flex-gateway/dev/redis_pw]
module.flex_gateway.aws_ssm_parameter.loki_user: Refreshing state... [id=/flex-gateway/dev/loki_user]
module.flex_gateway.aws_vpc_security_group_ingress_rule.alb_inbound_http_from_anywhere: Refreshing state... [id=sgr-06d663a0003c8311d]
module.flex_gateway.aws_vpc_security_group_ingress_rule.alb_inbound_https_from_anywhere: Refreshing state... [id=sgr-08ebdba757d0e821a]
module.flex_gateway.aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:975050025792:loadbalancer/app/flex-gateway-dev/6867ecfa66e4ed64]
module.flex_gateway.aws_vpc_security_group_ingress_rule.ec2_inbound_http_from_alb: Refreshing state... [id=sgr-0b0fb4b8205d24817]
module.flex_gateway.aws_vpc_security_group_egress_rule.alb_outbound_all_to_ec2: Refreshing state... [id=sgr-0efee9665a411af85]
module.flex_gateway.aws_vpc_security_group_ingress_rule.redis_inbound_redis_from_ec2: Refreshing state... [id=sgr-0d6824b94c5cd9e10]
module.flex_gateway.aws_vpc_security_group_ingress_rule.ec2_inbound_flex_gateway_from_alb: Refreshing state... [id=sgr-03612f4a7c46d72ed]
module.flex_gateway.aws_vpc_security_group_egress_rule.ec2_outbound_all_to_everywhere: Refreshing state... [id=sgr-04ca1145242345ae8]
module.flex_gateway.aws_iam_policy.kms: Refreshing state... [id=arn:aws:iam::975050025792:policy/flex-gateway-dev-kms]
module.flex_gateway.aws_iam_instance_profile.ec2: Refreshing state... [id=flex-gateway-dev-ec2]
module.flex_gateway.aws_elasticache_replication_group.main: Refreshing state... [id=flex-gateway-dev]
module.flex_gateway.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:975050025792:listener/app/flex-gateway-dev/6867ecfa66e4ed64/14473f898693f361]
module.flex_gateway.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:975050025792:listener/app/flex-gateway-dev/6867ecfa66e4ed64/15e74af4b0f5ad91]
module.flex_gateway.aws_launch_template.main: Refreshing state... [id=lt-09cba693c47d96889]
module.flex_gateway.aws_autoscaling_group.main: Refreshing state... [id=flex-gateway-dev]
module.flex_gateway.aws_ssm_parameter.redis_endpoint: Refreshing state... [id=/flex-gateway/dev/redis_endpoint]
module.flex_gateway.aws_s3_bucket_public_access_block.main: Refreshing state... [id=phl-citygeo-flex-gateway-dev]
module.flex_gateway.aws_iam_policy.s3: Refreshing state... [id=arn:aws:iam::975050025792:policy/flex-gateway-dev-s3]
module.flex_gateway.aws_s3_bucket_server_side_encryption_configuration.main: Refreshing state... [id=phl-citygeo-flex-gateway-dev]
module.flex_gateway.aws_ssm_parameter.s3_name: Refreshing state... [id=/flex-gateway/dev/s3_name]
module.flex_gateway.aws_s3_object.registration: Refreshing state... [id=phl-citygeo-flex-gateway-dev/registration.yaml]
module.flex_gateway.aws_autoscaling_attachment.main: Refreshing state... [id=flex-gateway-dev-20250820193105164900000002]
module.flex_gateway.aws_iam_role_policy_attachments_exclusive.ec2: Refreshing state...
module.flex_gateway.aws_ssm_parameter.registration_s3_key: Refreshing state... [id=/flex-gateway/dev/registration_s3_key]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.flex_gateway.aws_ssm_parameter.flex_gateway_tag will be created
  + resource "aws_ssm_parameter" "flex_gateway_tag" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/flex-gateway/dev/flex_gateway_tag"
      + region         = "us-east-1"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.flex_gateway.aws_ssm_parameter.flex_gateway_version will be destroyed
  # (because aws_ssm_parameter.flex_gateway_version is not in configuration)
  - resource "aws_ssm_parameter" "flex_gateway_version" {
      - arn             = "arn:aws:ssm:us-east-1:975050025792:parameter/flex-gateway/dev/flex_gateway_version" -> null
      - data_type       = "text" -> null
      - has_value_wo    = false -> null
      - id              = "/flex-gateway/dev/flex_gateway_version" -> null
      - name            = "/flex-gateway/dev/flex_gateway_version" -> null
      - region          = "us-east-1" -> null
      - tags            = {} -> null
      - tags_all        = {} -> null
      - tier            = "Standard" -> null
      - type            = "String" -> null
      - value           = (sensitive value) -> null
      - value_wo        = (write-only attribute) -> null
      - version         = 2 -> null
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Weastie*